Revit 2027 API
GeometryInstance.GetSymbolGeometry Method
Overload List
Name | Description
GetSymbolGeometry() | Computes the geometric representation of the symbol which generates this instance.
GetSymbolGeometry(Transform) | Computes a transformation of the geometric representation of the symbol which generates this instance.
Top
See Also
Reference
GeometryInstance Class
Autodesk.Revit.DB Namespace